// Написать программу, которая будет выдавать название дня недели по заданному номеру
Console.WriteLine("Введем  число 3 или 5: ");
string num = Console.ReadLine();
if (num == "3")
{
    Console.WriteLine("Сегодня среда");
}
else
{
    Console.WriteLine("Сегодня пятница");
}

//int what = new Random().Next(0,2);
//if (what == 0 )
//{
//    int x = 3;
//}
//if (what == 1)
//{
//    int x = 5;
//}
//Console.WriteLine(x);
//if (x == 3)
//{
//    Console.WriteLine("Day = Wednesday");
//}
//else
//{
  //  Console.WriteLine("Day = Friday");
//}
