// Напишите программу, которая на вход принимает число и выдает его квадрат (число умноженное на самао себя)

//int num = 5;
//int Result = num*num;
int num = int.Parse(Console.ReadLine());
int Result = num * num;
Console.WriteLine(Result);