// Напишите программу, которая на вход принимает число и выдает его квадрат (число умноженное на самао себя)

int num = 5;
//int Result = num*num;
double Result = Math.Pow(num, 5);
Console.WriteLine(Result);
